static/presentations/2018-11-28/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Gro-Seq</title>
<meta name="author" content="(Edmund Miller)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org57c59d3">
<h2 id="org57c59d3">GRO-Seq Analysis</h2>
<div class="outline-text-2" id="text-org57c59d3">
</div>
</section>
</section>
<section>
<section id="slide-orgcd3f57f">
<h3 id="orgcd3f57f">IMR90</h3>
<div class="outline-text-3" id="text-orgcd3f57f">
</div>
</section>
<section id="slide-org09d2b0d">
<h4 id="org09d2b0d">Overview of Project for new Members</h4>
<ul>
<li>Compared IMR90 Predicted Enhancers to GM</li>
<li>Ran GREAT Analysis on them</li>
<li>Began working to find coverage of eRNAs in Samples</li>

</ul>
</section>
<section id="slide-org679bab4">
<h4 id="org679bab4">Compared IMR90 Predicted Enhancers to GM</h4>
</section>
<section id="slide-orgd60d60e" data-background="img/Venn.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orgd60d60e"></h4>
</section>
<section id="slide-org1ad1896">
<h4 id="org1ad1896">Snakemake</h4>
</section>
<section id="slide-orgfb6a904" data-background="img/dag.png" data-background-size="400px" data-background-transition="slide">
<h4 id="orgfb6a904"></h4>
</section>
<section id="slide-org6a52b6f">
<h4 id="org6a52b6f">What this might look like as a shell script</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>fastqc *.fastq -o=/media/enhancer/IMR90/fastqc -t=<span style="color: #da8548; font-weight: bold;">6</span>
<span style="color: #51afef;">for</span> i<span style="color: #51afef;"> in</span> <span style="color: #51afef; font-weight: bold;">`</span><span style="color: #51afef; font-weight: bold;">ls</span><span style="color: #51afef; font-weight: bold;"> *.fastq | cut -d "_" -f 1`</span> ;
    <span style="color: #51afef;">do</span> bowtie2 -t -p <span style="color: #da8548; font-weight: bold;">4</span> -x ../2018-06-24/genome $<span style="color: #dcaeea;">i</span> -S $<span style="color: #dcaeea;">i</span>.sam ;
<span style="color: #51afef;">done</span> ;
<span style="color: #ECBE7B;">mv</span> data/2018-06-23/*.sam results/2018-07-10/
makeTagDirectory results/2018-07-11/All_together/ -genome hg19 -checkGC results/2018-07-10/*.sam
findPeaks results/2018-07-11/All_together/ -o results/2018-07-12/IMRpeak.gtf -style groseq
pos2bed.pl results/2018-07-12/GMpeak.gtf &gt; results/2018-07-12/GMpeak.bed
slopBed -i refseqhg19.bed -g Homo_sapiens/ucsc/hg19/Seqence/WholeGenomeFasta/genome.fa.fai -l <span style="color: #da8548; font-weight: bold;">1000</span> -r <span style="color: #da8548; font-weight: bold;">10000</span> &gt; slop-refseqhq19.bed
bedtools intersect -a GM/GMGRO-Seq/IMR90tsspeak.bed -b slop-refseqhg19.bed -v &gt; noGenesIMR90tss.bed
intersectBed -wo -a IMR90/BED/sorted_GroseqIMR90nogenes.bed -b /media/enhancer/eRNA_GM_hg19.bed &gt; eRNA_IMR90_GM_hg19_Overlap.bed
</code></pre>
</div>
</section>
<section id="slide-orgfdd6209">
<h4 id="orgfdd6209">Trying to Reproduce GM</h4>
<div class="outline-text-4" id="text-orgfdd6209">
</div>
<ul class="org-ul">
<li><a id="org717ac99"></a>hg18 vs hg19<br /></li>
<li><a id="org243aa4f"></a>Overpredicting eRNA transcripts<br /></li>
</ul>
</section>
</section>
<section>
<section id="slide-orgef3c184">
<h3 id="orgef3c184">Things That Went Differently This Time</h3>
<div class="outline-text-3" id="text-orgef3c184">
</div>
</section>
<section id="slide-org008bfca">
<h4 id="org008bfca">Past Issue</h4>
<div class="outline-text-4" id="text-org008bfca">
</div>
<ul class="org-ul">
<li><a id="org41adf0b"></a>What I thought happened<br /></li>
<li><a id="org50ff614"></a>hg18 -&gt; eRNAs -&gt; Me<br /></li>
<li><a id="orgec6a32e"></a>What actually happened<br /></li>
<li><a id="org8336775"></a>hg18 -&gt; eRNAs -&gt; LiftOver -&gt; hg19 -&gt; Me<br /></li>
</ul>
</section>
<section id="slide-orge8295bb">
<h4 id="orge8295bb">Organized Tasks</h4>
</section>
<section id="slide-org4360fc0" data-background="img/oldKanban.png" data-background-size="1400px" data-background-transition="slide">
<h4 id="org4360fc0"></h4>
</section>
<section id="slide-org74ceb95" data-background="img/newKanban.png" data-background-size="1400px" data-background-transition="slide">
<h4 id="org74ceb95"></h4>
</section>
<section id="slide-orga4cbe8b">
<h4 id="orga4cbe8b">AWS-iGenome</h4>
<p>
<a href="https://ewels.github.io/AWS-iGenomes/">https://ewels.github.io/AWS-iGenomes/</a>
</p>
</section>
</section>
<section>
<section id="slide-org114f589">
<h3 id="org114f589">Visualization</h3>
<div class="outline-text-3" id="text-org114f589">
</div>
</section>
<section id="slide-org6314622">
<h4 id="org6314622">GM 18 Pipeline</h4>
<script src="https://d3js.org/d3.v5.min.js"></script>
<section>
<div class="fig-container"
data-file="visualization/GM18.html/"></div> <!-- path to the html file with visualization code -->
</section>
</section>
<section id="slide-org8e8a268">
<h4 id="org8e8a268">GM 19 Pipeline</h4>
<script src="https://d3js.org/d3.v5.min.js"></script>
<section>
<div class="fig-container"
data-file="visualization/GM19.html/"></div> <!-- path to the html file with visualization code -->
</section>
</section>
<section id="slide-orge5a785c">
<h4 id="orge5a785c">IMR Pipeline</h4>
<script src="https://d3js.org/d3.v5.min.js"></script>
<section>
<div class="fig-container"
data-file="visualization/GM19.html/"></div> <!-- path to the html file with visualization code -->
</section>
</section>
</section>
<section>
<section id="slide-org4dddb31">
<h3 id="org4dddb31">Results</h3>
<div class="outline-text-3" id="text-org4dddb31">
</div>
</section>
<section id="slide-org33d396c">
<h4 id="org33d396c">GM Reproduction</h4>
</section>
<section id="slide-orga3ae2bc" data-background="img/Figure_1.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orga3ae2bc"></h4>
</section>
<section id="slide-orga493551" data-background="img/Figure_2.png" data-background-size="800px" data-background-transition="slide">
<h4 id="orga493551"></h4>
</section>
<section id="slide-orgb015853">
<h4 id="orgb015853">Results in progress</h4>
<div class="outline-text-4" id="text-orgb015853">
</div>
<ul class="org-ul">
<li><a id="org386cdc7"></a>GM hg19<br /></li>
<li><a id="org4518f81"></a>IMR hg19<br /></li>
<li><a id="orgca5c88f"></a>Jobs Running<br />
<div class="org-src-container">

<pre  class="src src-sh"><code trim>Job counts:
    count   jobs
    <span style="color: #da8548; font-weight: bold;">1</span>   GM_hg19_HistonesIntersect
    <span style="color: #da8548; font-weight: bold;">1</span>   GM_hg19_findPeaks
    <span style="color: #da8548; font-weight: bold;">1</span>   GM_hg19_pos2bed
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_H3K27ac_fastq
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_H3K4me1_fastq
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_hg19_All_makeTagDirectory
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_hg19_HistonesIntersect
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_hg19_RemoveGenes
    <span style="color: #da8548; font-weight: bold;">2</span>   IMR_hg19_alignHistones
    <span style="color: #da8548; font-weight: bold;">8</span>   IMR_hg19_bowtie2
    <span style="color: #da8548; font-weight: bold;">2</span>   IMR_hg19_convert_Histones_to_Bed
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_hg19_findPeaks
    <span style="color: #da8548; font-weight: bold;">1</span>   IMR_hg19_pos2bed
    <span style="color: #da8548; font-weight: bold;">2</span>   IMR_hg19_sort_Histones_Bed
    <span style="color: #da8548; font-weight: bold;">1</span>   all
    <span style="color: #da8548; font-weight: bold;">1</span>   hg19_RemoveGenes
    <span style="color: #da8548; font-weight: bold;">1</span>   test_IMR90_hg19_vs_Peng
    <span style="color: #da8548; font-weight: bold;">1</span>   test_IMR_hg19_vs_GM_hg19
    <span style="color: #da8548; font-weight: bold;">1</span>   test_IMR_hg19_vs_liftOver
    <span style="color: #da8548; font-weight: bold;">29</span>
</code></pre>
</div>
</li>
</ul>
</section>
</section>
<section>
<section id="slide-org319f904">
<h3 id="org319f904">Future</h3>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
